tap "conduktor/brew"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "pantsbuild/tap"
tap "peak/s5cmd", "https://github.com/peak/s5cmd"
brew "adr-tools"
brew "xz"
brew "jpeg-xl"
brew "readline"
brew "sqlite"
brew "aria2"
brew "gcc"
brew "libevent"
brew "open-mpi"
brew "openblas"
brew "asciinema"
brew "glib"
brew "python@3.9"
brew "harfbuzz"
brew "openjdk"
brew "avro-tools"
brew "docutils"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "openjdk@11"
brew "bazel"
brew "bpytop"
brew "brew-cask-completion"
brew "cmake"
brew "cmatrix"
brew "libyaml"
brew "commitizen"
brew "coreutils"
brew "csshx"
brew "dive"
brew "docker", link: false
brew "docker-credential-helper-ecr", link: false
brew "unbound"
brew "libarchive"
brew "pango"
brew "snappy"
brew "tesseract"
brew "ffmpeg"
brew "fftw"
brew "netpbm"
brew "findutils"
brew "fish"
brew "fzf"
brew "gh"
brew "gimme-aws-creds"
brew "git"
brew "tcl-tk"
brew "git-gui"
brew "git-secrets"
brew "gitlint"
brew "glances"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "gobject-introspection"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "groonga"
brew "helm"
brew "htop"
brew "hub"
brew "hyperfine"
brew "libheif"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "k9s"
brew "libev"
brew "llvm"
brew "llvm@11"
brew "make"
brew "mas"
brew "maven"
brew "minikube"
brew "mysql@5.7", link: true
brew "n"
brew "ncdu"
brew "neovim"
brew "node", link: false
brew "pyqt@5"
brew "sundials"
brew "octave"
brew "openjdk@17"
brew "openjdk@8"
brew "openssh"
brew "openssl@3", link: false
brew "parquet-tools"
brew "perl"
brew "virtualenv"
brew "pre-commit"
brew "py-spy"
brew "pyenv"
brew "qt"
brew "pyqt"
brew "python@3.8"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "rust"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "sip"
brew "snzip"
brew "sphinx-doc"
brew "steampipe"
brew "stow"
brew "tbb"
brew "telnet"
brew "terraform"
brew "terragrunt"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "z"
brew "zlib"
brew "zsh"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "alfred"
cask "anaconda"
cask "authy"
cask "bitwarden"
cask "calibre"
cask "conduktor"
cask "db-browser-for-sqlite"
cask "docker"
cask "foxitreader"
cask "iterm2"
cask "jetbrains-toolbox"
cask "logseq"
cask "maccy"
cask "pants"
cask "postman"
cask "pycharm-ce"
cask "rectangle"
cask "spotify"
cask "steam"
cask "todoist"
cask "vagrant"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "4ops.terraform"
vscode "akamud.vscode-theme-onedark"
vscode "bierner.markdown-mermaid"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "hashicorp.terraform"
vscode "mathiasfrohlich.Kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "njpwerner.autodocstring"
vscode "redhat.java"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryanolsonx.solarized"
vscode "shakram02.bash-beautify"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "vintharas.learn-vim"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
