tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "peak/s5cmd", "https://github.com/peak/s5cmd"
brew "adr-tools"
brew "aria2"
brew "gcc"
brew "libevent"
brew "openjdk"
brew "avro-tools"
brew "python@3.9"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "openjdk@11"
brew "bazel"
brew "bpytop"
brew "brew-cask-completion"
brew "glib"
brew "cmake"
brew "cmatrix"
brew "commitizen"
brew "coreutils"
brew "csshx"
brew "dive"
brew "docker", link: false
brew "docker-credential-helper-ecr", link: false
brew "harfbuzz"
brew "snappy"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "fish"
brew "fzf"
brew "gh"
brew "gimme-aws-creds"
brew "git"
brew "git-gui"
brew "git-secrets"
brew "glances"
brew "gnu-sed"
brew "gnupg"
brew "pango"
brew "gnuplot"
brew "go"
brew "grep"
brew "helm"
brew "htop"
brew "hub"
brew "hyperfine"
brew "libheif"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "k9s"
brew "libev"
brew "libyaml"
brew "make"
brew "mariadb", link: false
brew "mas"
brew "maven"
brew "minikube"
brew "mysql"
brew "mysql@5.7"
brew "n"
brew "ncdu"
brew "neovim"
brew "node", link: false
brew "pyqt@5"
brew "sundials"
brew "octave"
brew "openjdk@8"
brew "openssh"
brew "parquet-tools"
brew "perl"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyqt"
brew "python@3.8"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "sip"
brew "snzip"
brew "sphinx-doc"
brew "stow"
brew "tbb"
brew "telnet"
brew "terraform"
brew "terragrunt"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "z"
brew "zlib"
brew "zsh"
brew "peak/s5cmd/s5cmd"
cask "alacritty"
cask "alfred"
cask "anaconda"
cask "authy"
cask "bitwarden"
cask "docker"
cask "foxitreader"
cask "iterm2"
cask "jetbrains-toolbox"
cask "maccy"
cask "postman"
cask "pycharm-ce"
cask "rectangle"
cask "spotify"
cask "steam"
cask "todoist"
cask "vagrant"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
