cask_args appdir: "/Applications"

# Core homebrew 
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/versions"
tap "homebrew/core"
brew "brew-cask-completion"
brew "coreutils"

# git and github
brew "git"
brew "git-secrets"
brew gh


# JVMs
brew "sbt"
brew "scala"
brew "maven"
brew "snappy"
cask "jetbrains-toolbox"                    # Try doing JVM without it
cask "visual-studio-code"					# The suprising Text editor of the 2020s
cask "java8"
brew "avro-tools"							# a set of tools to work with avro files
brew "parquet-tools"                        # Parquet reader utils

# Docker and k8s
brew "helm"
brew "terraform"
brew "minikube"
brew "terragrunt"
brew  "kubectl"
brew  "awscli"
cask "docker"
brew "mysql" 
brew "gimme-aws-creds"

#Python 
pybrew "python"
brew "pyenv"
brew "libev"                               # For installing local cassandra drivers in python

# Node
brew "node"

# Redis
brew "redis"

# Bash quality of life
brew "bat" 									# cat with syntax highlighting and git diffs
brew "fzf"									# a fuzzy finder for the terminal
brew "htop"									# the best system task manager
brew "jq"									# json parser for the terminal
brew "shellcheck"							# testing shell scripts
brew "telnet"								# might be usefull sometime
brew "tmux"									# terminal multiplexer
brew "wget"									# when curl is not enough
brew "the_silver_searcher"					# the best text search tool
brew "tree"

# Misc. Applications
cask "google-chrome"
cask "iTerm2"
cask "spotify"
cask "authy"
cask "bitwarden"

# mac packages
brew "mas"
cask "rectangle"                            # window snapping tool
cask "alfred"								# control your mac from your keyboard
mas "Slack", id: 803453959
mas "WhatsApp Desktop", id: 1147396723 		# if you HAVE to talk to someone outside of work
