cask_args appdir: "/Applications"
 
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/versions"
tap "homebrew/core"
 
brew "brew-cask-completion"
brew "coreutils"

brew "fish"
brew "git"
brew "git-secrets"
brew "mas"
brew "n"
brew "node"
brew "redis"
brew "sbt"
brew "scala"
brew "z"                                    #cd Improver 
brew "mysql" 
brew "maven"
brew "snappy"
brew "helm"
brew "terraform"
brew "minikube"
brew "terragrunt"
brew gh
brew "gimme-aws-creds"
pybrew "python"
brew "pyenv"
brew "thefuck"
brew  "kubectl"
brew  "awscli"
brew "octave"
brew "libev"                               # For installing local cassandra drivers in python
cask "iTerm2"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "java8"
cask "virtualbox"
cask "vagrant"
cask "docker"
brew "fd"

mas "Slack", id: 803453959

brew "avro-tools"							# a set of tools to work with avro files
brew "bat" 									# cat with syntax highlighting and git diffs
brew "fzf"									# a fuzzy finder for the terminal
brew "htop"									# the best system task manager
brew "hub"									# enhance git with GitHub commnads
brew "jq"									# json parser for the terminal
brew "reattach-to-user-namespace"			# for using pbcopy with tmux
brew "shellcheck"							# testing shell scripts
brew "telnet"								# might be usefull sometime
brew "tmux"									# terminal multiplexer
brew "wget"									# when curl is not enough
brew "the_silver_searcher"					# the best text search tool
brew "tree"
brew "parquet-tools"                        # Parquet reader utils
brew "avro-tools"                           # Avro reading utils
cask "alfred"								# control your mac from your keyboard
cask "karabiner-elements"					# customize your keyboard even more
cask "spectacle"							# window snapping tool
cask "visual-studio-code"					# the best GUI text editor
cask "dropbox"								# some cloud storage for you
cask "google-backup-and-sync"				# aka Google Drive
cask "postman"                              # Http client
cask "spotify"
cask "authy"
cask "cerbro"
cask "clipy"
mas "WhatsApp Desktop", id: 1147396723 		# if you HAVE to talk to someone outside of work

