tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "openssl@1.1"
brew "libevent"
brew "openjdk"
brew "avro-tools"
brew "python@3.9"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bazel"
brew "bpytop"
brew "brew-cask-completion"
brew "glib"
brew "cmake"
brew "commitizen"
brew "coreutils"
brew "csshx"
brew "dive"
brew "libev"
brew "harfbuzz"
brew "snappy"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "fish"
brew "fzf"
brew "gh"
brew "gimme-aws-creds", link: false
brew "git"
brew "git-gui"
brew "git-secrets"
brew "gnu-sed"
brew "gnupg"
brew "pango"
brew "gnuplot"
brew "grep"
brew "helm"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "k9s"
brew "make"
brew "mas"
brew "maven"
brew "minikube"
brew "mysql", link: false
brew "n"
brew "ncdu"
brew "node"
brew "pyqt@5"
brew "tbb"
brew "sundials"
brew "openssh"
brew "parquet-tools"
brew "perl"
brew "pre-commit"
brew "pyenv"
brew "pyqt"
brew "python@3.8"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "sip"
brew "sphinx-doc"
brew "telnet"
brew "terraform"
brew "terragrunt"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "z"
brew "tldr"
brew "zlib"
brew "openjdk@8"
brew "openjdk@11"
brew "openjdk@17"
cask "alfred"
cask "foxitreader"
cask "authy"
cask "bitwarden"
cask "docker"
cask "iterm2"
cask "jetbrains-toolbox"
cask "maccy"
cask "postman"
cask "rectangle"
cask "spotify"
cask "vagrant"
cask "visual-studio-code"
mas "Todoist", id: 585829637
mas "WhatsApp", id: 1147396723
